{
    "astilbe": {
        "description": "Astilbes are the perfect flowers for adding a feathery, elegant touch to shady spots in your garden. Their wispy, plume-like blooms come in shades of pink, red, and white, and they're often called 'false spirea' because of their similar look.",
        "characteristics": "Feathery, plume-like blooms; prefers shade; comes in pink, red, and white; elegant appearance.",
        "fun_fact": "Astilbe is a super easy-going flower and a favorite of hummingbirds and butterflies!"
    },
    "bellflower": {
        "description": "True to their name, bellflowers have darling, bell-shaped blossoms that dangle delicately. They come in a rainbow of colors, but their most iconic shade is a lovely blue or violet. Bellflowers are surprisingly tough and can thrive in rock gardens or as border plants.",
        "characteristics": "Bell-shaped blossoms; delicate; tough and hardy; comes in blue, violet, and other colors.",
        "fun_fact": "In some folklore, it's said that fairies live inside the little bells!"
    },
    "black-eyed susan": {
        "description": "With their bright yellow or orange petals and a prominent, dark center, these flowers are like a burst of sunshine! They're a classic wildflower and are incredibly hardy and easy to grow. Black-eyed Susans symbolize encouragement and justice.",
        "characteristics": "Bright yellow/orange petals; dark center; hardy and easy to grow; classic wildflower.",
        "fun_fact": "The dark center is actually a cluster of tiny, disc florets, and they're a huge favorite of bees and butterflies!"
    },
    "calendula": {
        "description": "Calendula, also known as pot marigold, is a cheerful flower with bright orange or yellow petals that look like mini suns. It's not just a pretty face—calendula has been used for centuries in herbal medicine and cooking. Its petals are even edible!",
        "characteristics": "Bright orange/yellow petals; looks like a mini sun; edible petals; used in herbal medicine and cooking.",
        "fun_fact": "The word 'calendula' comes from the Latin word 'kalendae,' meaning 'little calendar,' because it was thought to bloom year-round."
    },
    "california poppy": {
        "description": "The California poppy is a vibrant, cup-shaped flower known for its brilliant orange and yellow petals. It's the state flower of California, and its silky blossoms close at night and on cloudy days to conserve energy.",
        "characteristics": "Cup-shaped; vibrant orange and yellow; closes at night; drought-tolerant; native to western North America.",
        "fun_fact": "California poppies were once so abundant that Spanish explorers noted seeing entire hillsides ablaze with their orange glow, thinking they were fields of gold."
    },
    "carnation": {
        "description": "Carnations are a classic, frilly flower with a sweet, clove-like fragrance. They come in a wide variety of colors, and each color can carry a different meaning, from pure love to fascination. They are a popular choice for bouquets and boutonnieres.",
        "characteristics": "Frilly, layered petals; sweet, spicy fragrance; wide range of colors; long-lasting cut flower.",
        "fun_fact": "The word 'carnation' is believed to come from the Greek word 'dios,' meaning 'god,' and 'anthos,' meaning 'flower,' making it the 'flower of the gods.'"
    },
    "common daisy": {
        "description": "The common daisy is a familiar sight with its simple white petals and bright yellow center. Often seen in lawns and fields, this humble flower symbolizes innocence and purity. It's a low-growing, perennial plant that adds a cheerful touch wherever it pops up.",
        "characteristics": "Simple white petals; bright yellow center; low-growing; perennial; symbolizes innocence and purity.",
        "fun_fact": "The name 'daisy' is a shortened version of 'day's eye,' because the flower's petals close at night and open again in the morning as the new day begins."
    },
    "coreopsis": {
        "description": "Coreopsis, also known as tickseed, is a bright and cheerful wildflower with daisy-like flowers. They typically have yellow or pink petals with a dark center and bloom for a long time, making them a favorite for adding continuous color to gardens.",
        "characteristics": "Daisy-like flowers; long blooming period; comes in yellow and pink; drought-tolerant; attracts butterflies.",
        "fun_fact": "The name 'tickseed' comes from the seeds' resemblance to ticks, though they are completely harmless."
    },
    "dandelion": {
        "description": "Often considered a weed, the dandelion is actually a resilient wildflower with a bright yellow blossom. The entire plant is edible, from its bitter greens to its sunny flowers. When it goes to seed, it transforms into a puffy, white globe perfect for making wishes.",
        "characteristics": "Bright yellow flower; edible parts; transforms into a fluffy seed head; resilient and widespread.",
        "fun_fact": "Dandelions have a very deep taproot, which is what makes them so tough. The root can grow up to 15 feet deep to access water!"
    },
    "iris": {
        "description": "Irises are known for their spectacular, intricate flowers and sword-like foliage. Named after the Greek goddess of the rainbow, they come in nearly every color imaginable, and their unique shape makes them a standout in any garden.",
        "characteristics": "Spectacular, intricate flowers; sword-like foliage; wide range of colors; named after the goddess of the rainbow.",
        "fun_fact": "The iris is the national flower of France. The fleur-de-lis, a stylized symbol of a lily, is actually thought to be a representation of an iris flower."
    },
    "rose": {
        "description": "Roses are the ultimate symbol of love and beauty, with their velvety petals and sweet fragrance. They come in countless varieties, from classic reds to soft pastels, and their thorny stems are a reminder that true beauty often comes with protection.",
        "characteristics": "Velvety petals; strong fragrance; thorny stems; wide variety of colors and forms; classic symbol of love.",
        "fun_fact": "The world's oldest living rose bush is believed to be over 1,000 years old and grows on the wall of the Hildesheim Cathedral in Germany."
    },
    "sunflower": {
        "description": "Sunflowers are iconic for their towering height and large, bright yellow faces that follow the sun throughout the day. They symbolize adoration and loyalty, and their seeds are a popular snack for both people and birds.",
        "characteristics": "Tall stalks; large, bright yellow face; tracks the sun; edible seeds; symbolizes adoration.",
        "fun_fact": "The head of a sunflower is not just one flower, but a composite of thousands of tiny flowers called florets."
    },
    "tulip": {
        "description": "Tulips are a beloved spring bulb flower known for their elegant, cup-shaped blossoms and a huge range of colors. They are a sign that warmer weather is on its way and are often associated with new beginnings and perfect love.",
        "characteristics": "Cup-shaped blossoms; bulb flower; wide variety of colors; a sign of spring; elegant and simple.",
        "fun_fact": "During the 'tulip mania' of the 17th century in Holland, a single tulip bulb could cost more than a house! It was one of the first economic bubbles."
    },
    "water lily": {
        "description": "Water lilies are breathtaking aquatic flowers that float on the surface of ponds and lakes. Their beautiful, star-shaped blossoms and large, round pads create a peaceful and serene scene. They symbolize purity and enlightenment.",
        "characteristics": "Aquatic flower; star-shaped blossoms; large, floating pads; symbolizes purity; thrives in still water.",
        "fun_fact": "The water lily's pads are designed to float by having air pockets, which also allow the plant to absorb carbon dioxide from the atmosphere."
    }
}